blog/2011/01/02/solar-connect-to-oracle-problems/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>Solar连接Oracle存在的问题！ - Gu Weigang</title>
  <meta charset="utf-8" />
  <meta name="author" content="Gu Weigang" />
  <meta name="description" content="" />
  <meta name="keywords" content="" />

  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">

  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/prettify.css" type="text/css">
</head>

  <body class="container">
<header id="header">
  <h1 class="title"><a href="/">Gu Weigang</a></h1>
  <ul>
    <li><a href="/blog/">Blog</a></li>
    <li><a href="/tags/">Tags</a></li>
    <li><a href="/about/">About</a></li>
  </ul>
  <form method="get" id="search" action="https://duckduckgo.com">
    <input type="text" class="field" name="q" id="s" placeholder="Search">
    <input type="hidden" name="q" value="site:guweigang.com">
  </form>
</header>

<section id="content" role="main">
  <h1>Solar连接Oracle存在的问题！</h1>
  <p>
前段时间朋友@东疯 使用Solar连接Oracle，死活都连不上，搞了好久天，所以我也找时间研究了下。看这里：<a href="http://wiki.oracle.com/page/PHP+Oracle+FAQ"><a href="http://wiki.oracle.com/page/PHP+Oracle+FAQ">http://wiki.oracle.com/page/PHP+Oracle+FAQ</a></a>。使用PDO连接Oracle：
</p>


<pre class="example">
try {
$dbh = new PDO('oci:dbname=myhost/XE', 'myusername', 'mypassword');
} 
catch (PDOException $e) {
trigger_error("Could not connect to database: ". $e-&gt;getMessage(), E_USER_ERROR);
}
</pre>


<p>
有三种合法字符串：
</p>
<ol class="org-ol">
<li>简易连接
</li>
</ol>


<pre class="example">
$c = oci_connect('myusername', 'mypassword', 'mymachine.mydomain/MYDB');
$d = new PDO('oci:dbname=myhost/XE', 'myusername', 'mypassword');
//或
$c = oci_connect('myusername', 'mypassword', '127.0.0.1/XE');
$d = new PDO('oci:dbname=127.0.0.1/XE', 'myusername', 'mypassword');
</pre>



<ol class="org-ol">
<li>一个用户选择的网络服务名通常用来识别的数据库连接。
</li>
</ol>


<pre class="example">
$c = oci_connect('myusername', 'mypassword', 'MYDB');
$d = new PDO('oci:dbname=MYDB', 'myusername', 'mypassword');
</pre>


<p>
tnsnames.ora文件内容
</p>


<pre class="example">
MYDB =
(DESCRIPTION =
(ADDRESS = (PROTOCOL = TCP)(HOST = mymachine.mydomain)(PORT = 1521))
(CONNECT_DATA =
(SERVER = DEDICATED)
(SERVICE_NAME = MYDB)
)
)
</pre>


<ol class="org-ol">
<li>如果简单连接方法被禁用了，你使用的又是Oracle 8i或9i库，你可以这样做。
</li>
</ol>


<pre class="example">
$db = "(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)
(HOST = mymachine.mydomain)(PORT=1521))
(CONNECT_DATA=(SERVER=DEDICATED)
(SERVICE_NAME=MYDB)))";

$c = oci_connect('myusername', 'mypassword', $db);
$d = new PDO("oci:dbname=$db", 'myusername', 'mypassword');
</pre>



<p>
看到了吧？这和PHP的PDO连接方式很不一样，所以Solar的Sql\_Oracle\_Adapter类的\_buildDsn应该修改一下：
</p>


<pre class="example">
$info = array(
    'host' =&gt; '192.168.1.118',
    'port' =&gt; '1521',
    'name' =&gt; 'pzblog',     // the service id
    'user' =&gt; 'root',       // authenticate as this user
    'pass' =&gt; '123456',     // authenticate with this password

);
class Solar_Sql_Adapter_Oracle
{
    protected $_pdo_type = 'oci';

    protected function _buildDsn($info)
    {
        $dsn = array();

        if (! empty($info['host'])) {
            $dsn[] = 'dbname=//' . $info['host'];
        }

        if (! empty($info['port'])) {
            $dsn[] = ':' . $info['port'];
        }

        if (! empty($info['name'])) {
            $dsn[] = '/' . $info['name'];
        }

        return $this-&gt;_pdo_type . ':' . implode('', $dsn);
    }
}
</pre>

</section>



<footer id="footer">
    Send comments, critique and suggestions to <a href="mailto:guweigang &lt;at&gt; outlook &lt;dot&gt; com">Gu Weigang</a>.
    Powered by <a href="https://github.com/kelvinh/org-page">org-page</a>
</footer>

  </body>
</html>
